app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @article = Article.find(params['id'])

INSERT INTO "articles" ("title", "description", "slug", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "My article title"], ["description", "My article description"], ["slug", "my-article-title"], ["created_at", "2019-12-04 19:45:59.081251"], ["updated_at", "2019-12-04 19:45:59.081251"]]
---
  def create
    @article = Article.new
    @article.title = params[:title]
    @article.description = params[:description]

    @article.save